import React from 'react'
import Layout from '../components/layout'
import { initPocketBase } from '../lib/auth';

const disclaimerText = "ข้อตกลงในการใช้ซอฟต์แวร์ซอฟต์แวร์นี้เป็นผลงานที่พัฒนาขึ้นโดย กุ จากโรงเรียนวิทยาศาสตร์จุฬาภรณราชวิทยาลัย ตรัง ภายใต้การดูแลของ กุ ภายใต้โครงการ API ตารางเรียน ซึ่งสนับสนุนโดยสำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ(?)โดยมีวัตถุประสงค์เพื่อส่งเสริมให้นักเรียนและนักศึกษาได้เรียนรู้และฝึกทักษะในการพัฒนาซอฟต์แวร์ ลิขสิทธิ์ของซอฟต์แวร์นี้จึงเป็นของผู้พัฒนา ซึ่งผู้พัฒนาได้อนุญาตให้สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติเผยแพร่ซอฟต์แวร์นี้ตาม “ต้นฉบับ” โดยไม่มีการแก้ไขดัดแปลงใดๆ ทั้งสิ้นให้แก่บุคคลทั่วไปได้ใช้เพื่อประโยชน์ส่วนบุคคลหรือประโยชน์ทางการศึกษาที่ไม่มีวัตถุประสงค์ในเชิงพาณิชย์โดยไม่คิดค่าตอบแทนการใช้ซอฟต์แวร์ ดังนั้นสำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติจึงไม่มีหน้าที่ในการดูแลบำรุงรักษา จัดการอบรมการใช้งานหรือพัฒนาประสิทธิภาพซอฟต์แวร์ รวมทั้งไม่รับรองความถูกต้องหรือประสิทธิภาพการทำงานของซอฟต์แวร์ ตลอดจนไม่รับประกันความเสียหายต่าง ๆ อันเกิดจากการใช้ซอฟต์แวร์นี้ทั้งสิ้น"

export async function getServerSideProps({ req, res }) {
  const pb = await initPocketBase(req, res);
  const user = { ...pb.authStore.model }
  return {
    props: {
      user
    }
  };
}

function disclaimer({ user }) {
  return (
    <Layout title="Disclaimer" user={user} center>
      <p>
        {disclaimerText}
      </p>
    </Layout>
  )
}

export default disclaimer